In [1]:
import pandas as pd
# Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

# Series is like a column, a DataFrame is the whole table.

In [3]:
data={"name":["roshani","sagar","savi"],"salary":[50000,60000,70000]}

df=pd.DataFrame(data)
df

      name  salary
0  roshani   50000
1    sagar   60000
2     savi   70000

In [4]:
# Locate Row : Pandas use the loc attribute to return one or more specified row(s)
#refer to the row index:
print(df.loc[0])

name      roshani
salary      50000
Name: 0, dtype: object

In [6]:
print(df.loc[1])

name      sagar
salary    60000
Name: 1, dtype: object

In [7]:
#use a list of indexes:
print(df.loc[[0, 1]])

      name  salary
0  roshani   50000
1    sagar   60000

In [8]:
# Named Indexes
f={"name":["roshani","sagar"],"age":[89,67]}

In [11]:
s=pd.DataFrame(f,index=["x","y"])
s

      name  age
x  roshani   89
y    sagar   67